In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
# unique() method to find a unique values in a DataFrame and nunique() to retrieve the number of unique values 
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
#value_counts() method to get the number of occurance of each values in a column 
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
#apply() : using this method we can apply our customised built in functions 
def func_power2(x):
    return x**2
df['col1'].apply(func_power2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [9]:
len(df['col3'])

4

In [10]:
#to retrieve the length of each text element in a column 
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [11]:
# to retrieve some info about the column names and head of a dataframe 
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [14]:
df.index
#tells you start , stop and the stepsize of the indexes

RangeIndex(start=0, stop=4, step=1)

In [15]:
#sorting and Ordering the Dataframe by passing the column or axis to the method:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [16]:
# isnull() to find the null values in a dateframe 
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [14]:
#................... Data Input and Output.......................
# we can use Pandas to read or write data from/into diffent sources like CSV,HTML,Excel and SQL files
#for SQL and HTML files you need the following libraries 
#      conda install sqlalchemy
#      conda install lxml
#      conda install html5lib
#       

#when we are refering to a file like CSV file it should be in the same location of Jupyter notebook, to read a csv file : 
pd.read_csv('test.csv')

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
#there are variety of methods for reading different files like json, html, ... 
# to write into a file again we have different methods starting with dataframe.to_...
dataframe= pd.read_csv('test.csv')
dataframe['NewCol']=[0,0,0,0]
dataframe

    A   B   C   D  NewCol
0   0   1   2   3       0
1   4   5   6   7       0
2   8   9  10  11       0
3  12  13  14  15       0

In [4]:
#writig to a csv file
dataframe.to_csv('CSV_Output', index=False)

In [5]:
pd.read_csv('CSV_Output')

    A   B   C   D  NewCol
0   0   1   2   3       0
1   4   5   6   7       0
2   8   9  10  11       0
3  12  13  14  15       0

In [6]:
#reading Html with pandas : in this case Pandas will search for all the tables in that specific html page :
html_Page= pd.read_html('https://www.fasttrack.co.uk/league-tables/tech-track-100/league-table/')

In [7]:
 type(html_Page)

list

In [9]:
html_Page

[        0                                                  1                2  \
 0    Rank                                            Company         Location
 1       1                    Plan.comCommunications provider      Isle of Man
 2       2                     PsiOxusBiotechnology developer      Oxfordshire
 3       3         CensorNetCloud security software developer      Basingstoke
 4       4          thoughtonomyAutomation software developer      East London
 5       5                PerkboxEmployee engagement services   Central London
 6       6                         OguryMobile data marketing     North London
 7       7                  VerveMarketing software developer   Central London
 8       8          goHenryChildren's pre-paid card developer   Central London
 9       9                   DarktraceCybersecurity developer        Cambridge
 10     10                      BizumaB2B e-commerce platform   Central London
 11     11                           DepopSocial shopping app   Central London
 12     12  Laser Wire SolutionsLaser wire-stripping machi...       Pontypridd
 13     13        Bought By ManySpecialist insurance platform   Central London
 14     14                     OptalPayment services provider   Central London
 15     15                   InfinoxCurrency trading platform   Central London
 16     16                  OakbrookConsumer finance provider       Nottingham
 17     17                           CarwowCar sales platform   Central London
 18     18       Receipt BankBook-keeping automation services   Central London
 19     19          dB BroadcastBroadcast technology provider   Cambridgeshire
 20     20             The Car Buying GroupCar sales platform        Wakefield
 21     21                 FesticketFestival booking platform   Central London
 22     22                          PlanixsSoftware developer       Manchester
 23     23                GigaclearInternet services provider      Oxfordshire
 24     24             TransferWiseCurrency transfer provider      East London
 25     25                           PatSnapR&D data platform      West London
 26     26               HyperopticInternet services provider      West London
 27     27                GoCardlessPayment services provider   Central London
 28     28                       PurpleWifi services provider           Oldham
 29     29             Trustpay GlobalOnline payment provider        Guildford
 ..    ...                                                ...              ...
 71     71        Love Energy SavingsPrice comparison website           Bolton
 72     72                  Creative VirtualChatbot developer      East London
 73     73                     EburyBusiness finance provider   Central London
 74     74               ZappiStoreResearch services provider   Central London
 75     75                       BlisLocation data technology   Central London
 76     76                BookingBugBooking systems developer   Central London
 77     77                       EgressData security provider   Central London
 78     78              Contis GroupPayment services provider  North Yorkshire
 79     79                  PM ConnectMobile content provider       Birmingham
 80     80                  ZopaPeer-to-peer lending platform     South London
 81     81                   WorldRemitOnline money transfers   Central London
 82     82                 DianomiFinancial content marketing   Central London
 83     83                       LiberisCash advance provider      West London
 84     84             CurrencycloudPayment services provider      East London
 85     85           FeaturespaceAnalytics software developer        Cambridge
 86     86       Cloud Technology SolutionsCloud IT developer       Manchester
 87     87      Leisure Pass GroupTourism smartcard developer   Central London
 88     88                       rradarLegal digital services             Hull
 89     89                 Converge TSCloud services provider         Cheshire
 90     90              Kimble ApplicationsSoftware developer   Central London
 91     91              PaymentsensePayment services provider      West London
 92     92               Godel TechnologiesSoftware developer       Manchester
 93     93               Secret EscapesOnline travel services   Central London
 94     94                        NeuvenHR software developer       Manchester
 95     95                     CitNOWVideo software developer        Wokingham
 96     96                         geoSmart energy monitoring        Cambridge
 97     97              Vision RTMedical technology developer     North London
 98     98                      ThreadOnline fashion services   Central London
 99     99            The Media ImageDigital marketing agency     South London
 100   100       Brompton TechnologyVideo technology provider      West London

             3                               4                   5      6  \
 0    Year end  Annual sales rise over 3 years  Latest sales £000s  Staff
 1      Sep-17                         364.38%             *35,418     90
 2      Dec-17                         311.67%               53136     54
 3      Dec-17                         210.17%              *7,535     77
 4      May-18                         205.20%             *16,916    100
 5      Dec-17                         204.12%             *34,700    200
 6      Dec-17                         204.09%               33760    133
 7      Dec-17                         202.15%             *10,747    130
 8      Dec-17                         200.87%              *6,116     61
 9      Jun-18                         195.51%             *58,573    694
 10     Mar-18                         181.75%              *9,608     48
 11     Dec-17                         175.70%             *94,300     95
 12     Dec-17                         173.41%              *5,114     26
 13     Mar-18                         170.20%             *19,727     78
 14     Dec-17                         169.29%              177653     65
 15     Mar-18                         155.18%             *41,700     48
 16     Dec-17                         154.54%             *40,400     98
 17     Dec-17                         147.21%             *15,276    127
 18     Dec-17                         146.07%             *11,667    341
 19     Sep-17                         143.58%               34943     50
 20     Mar-18                         140.89%             *39,140     31
 21     Dec-17                         139.86%               35839     88
 22     Mar-17                         133.70%              *7,240     67
 23     Dec-17                         130.17%                7402    210
 24     Mar-18                         129.39%            *117,283   1000
 25     Dec-17                         126.18%             *17,977    752
 26     Dec-17                         119.90%               16572    411
 27     Dec-17                         112.99%             *11,896    165
 28     Jan-18                         112.88%              *5,586     93
 29     Mar-18                         110.45%              *9,796     25
 ..        ...                             ...                 ...    ...
 71     Dec-17                          64.26%               17361    183
 72     Dec-17                          63.30%              *8,400     99
 73     Apr-18                          62.77%             *47,000    628
 74     Dec-17                          61.62%               19323    128
 75     Dec-17                          61.28%             *33,400    186
 76     Mar-18                          60.61%              *6,937    117
 77     Dec-17                          60.22%                9403    115
 78     Mar-17                          59.56%                7161     86
 79     Feb-18                          59.44%             *19,317     35
 80     Dec-17                          59.43%             *46,500    312
 81     Dec-17                          59.07%             *61,000    440
 82     Dec-17                          58.99%             *12,861     25
 83     Dec-17                          57.99%             *15,150     75
 84     Dec-17                          57.48%             *13,600    140
 85     Dec-17                          57.48%              *5,170    113
 86     Mar-18                          57.21%             *21,902    102
 87     Dec-17                          57.16%            †225,803    105
 88     Dec-17                          57.03%              *5,083    125
 89     Dec-17                          55.00%              *5,802     38
 90     Dec-17                          54.67%              *9,153     78
 91     Mar-18                          53.54%             *72,400    243
 92     Dec-17                          53.01%             *13,853    637
 93     Dec-17                          52.99%             *73,000    850
 94     Jul-17                          52.23%              130071     28
 95     Dec-17                          51.85%             *11,611     71
 96     Mar-18                          51.24%             *29,406     85
 97     Jul-17                          50.99%               32468    132
 98     Dec-17                          50.77%              *6,492     60
 99     Feb-18                          50.38%             *27,515     37
 100    Aug-17                          50.17%              *5,250     27

                                                      7
 0                                              Comment
 1    About 650 partners use its telecoms platform t...
 2    Received a $15m milestone payment from its dev...
 3    Has more than 4,000 customers, including McDon...
 4    It sells to 28 countries and 50% of revenue is...
 5    Acquired software platform Loyalty Bay for an ...
 6    It has access to data from more than 400m mobi...
 7    Its network of 25,000 ‘micro-influencers’ have...
 8    The company is named after the first child to ...
 9    Was reportedly valued at $1.25bn in April when...
 10   Originally founded as a flash sales website be...
 11   More than 10m people use its platform to buy a...
 12   Swiss technology group Schleuniger took a 20% ...
 13   Launched its own travel insurance policy for p...
 14   Uses the Mastercard processing network to faci...
 15   Provides users with an AI-generated news feed ...
 16   Uses machine learning to help estimate borrowe...
 17   Claims its car review videos have more viewers...
 18   Says 150,000 businesses in America, Europe and...
 19   Its key customers include Sky, YouTube, Bloomb...
 20   Runs a free nationwide doorstep vehicle collec...
 21   Sells tickets and packages to more than 1,000 ...
 22   More than £200bn worth of transactions have be...
 23   Has connected more than 16,000 rural customers...
 24   Was valued at $1.6bn in November after it rais...
 25   Has raised more than $100m from investors incl...
 26   Aims to provide superfast broadband to more th...
 27   International expansion plans include targetin...
 28   Its technology is used in every public airport...
 29   The Premier Lotto in Nigeria uses the company’...
 ..                                                 ...
 71   Has helped 145,000 UK homes and businesses sav...
 72   Its trademarked chatbot can be used through Fa...
 73   Has traded £12.5bn in foreign exchange in 140 ...
 74   Holds weekly hackathons with its clients and p...
 75       Analyses more than 5.5bn data points each day
 76   Raised nearly £10m in April from backers inclu...
 77   Users of its platform can revoke access to ema...
 78   Appointed the former European boss of American...
 79   Its clients include World Wrestling Entertainm...
 80   About £3.5bn has been advanced through its pla...
 81   Has raised $220m since 2010 to expand its onli...
 82   Works with eight of the top 10 global asset ma...
 83   Received £57.5m in funding in April from inves...
 84   Has 250 clients and 2m end users across the world
 85   Is recruiting for more than 100 positions this...
 86   Its software has moved nearly 12,000 companies...
 87   Has partnered with the booking platform Ctrip ...
 88   Uses machine learning and AI to provide legal ...
 89   Focused solely on the legal sector after its f...
 90   More than half of its new business is in the U...
 91   Processed more than £6.5bn of card payments la...
 92   Is named after the late German mathematician K...
 93   Has raised £132m from investors including Goog...
 94   Appearing on Tech Track 100 for a fourth conse...
 95   Has more than 8,000 installations in franchise...
 96   Customers in Norway, Sweden and Luxembourg use...
 97   Has secured 60 patents and has another 46 pending
 98   More than 800,000 men subscribe to its free pe...
 99   Founded by the man who was Google UK’s first r...
 100  Its technology is used in high-profile events ...

 [101 rows x 8 columns]]

In [10]:
html_Page[0].head()

,0,1,2,3,4,5,6,7
0,Rank,Company,Location,Year end,Annual sales rise over 3 years,Latest sales £000s,Staff,Comment
1,1,Plan.comCommunications provider,Isle of Man,Sep-17,364.38%,"*35,418",90,About 650 partners use its telecoms platform t...
2,2,PsiOxusBiotechnology developer,Oxfordshire,Dec-17,311.67%,53136,54,Received a $15m milestone payment from its dev...
3,3,CensorNetCloud security software developer,Basingstoke,Dec-17,210.17%,"*7,535",77,"Has more than 4,000 customers, including McDon..."
4,4,thoughtonomyAutomation software developer,East London,May-18,205.20%,"*16,916",100,It sells to 28 countries and 50% of revenue is...

In [16]:
# reading a DB table in Python and generate a DataFrame out of that:
# for that you always should search the specific driver based on your specific SQL engine ex) postgrsql ==> psycopg2
#in the following example we create an SQL engine in memory 

from sqlalchemy import create_engine

engine=create_engine('sqlite:///:memory:')

In [17]:
 df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [18]:
#now we can write this Dataframe into our temporary engine (as a table in a DB) that we have running in memory, we pass the engine as the connection :
df.to_sql('table_test', engine)

In [19]:
sqldataFrame=pd.read_sql('table_test', con=engine)

In [20]:
sqldataFrame
#as you can see the index has been considered as a new column here

   index  col1  col2 col3
0      0     1   444  abc
1      1     2   555  def
2      2     3   666  ghi
3      3     4   444  xyz